In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r'C:\Users\mtt\Downloads\StudentsPerformance.csv')
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

Find out how many males and females participated in the test

In [3]:
df.value_counts('gender')

gender
female    518
male      482
dtype: int64

What do you think about the students' parental level of education?

In [4]:
df['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

Who scores the most on average for math, reading and writing based on
● Gender
● Test preparation course

In [5]:
dt =df.groupby('gender').mean()
dt

C:\Users\mtt\AppData\Local\Temp\ipykernel_15056\115368833.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dt =df.groupby('gender').mean()

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

Female students have higher average on reading and writting whereas male students have an higher score average on math

In [6]:
dt1 = df.groupby('test preparation course').mean()
dt1

C:\Users\mtt\AppData\Local\Temp\ipykernel_15056\1431970419.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dt1 = df.groupby('test preparation course').mean()

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

 Students who completed test preparation course have higher score.

What do you think about the scoring variation for math, reading and writing
based on
● Gender
● Test preparation course

In [7]:
dt= df.groupby('gender').std()
dt

C:\Users\mtt\AppData\Local\Temp\ipykernel_15056\3950680361.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dt= df.groupby('gender').std()

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

In [8]:
dt1=df.groupby('test preparation course').std()
dt1

C:\Users\mtt\AppData\Local\Temp\ipykernel_15056\3287965613.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dt1=df.groupby('test preparation course').std()

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

The management needs your help to give bonus points to the top 25% of
students based on their math score, so how will you help the management
to achieve this.

In [9]:
dt =df.nlargest(250, ['math score'])
dt.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99